---
kind: property
id: P:Autodesk.Revit.UI.TextBox.PromptText
source: html/2586f0f8-f6a9-f2a7-bc8b-6c7c7bc45bd0.htm
---
# Autodesk.Revit.UI.TextBox.PromptText Property

The prompt text for the text box.

## Syntax (C#)
```csharp
public string PromptText { get; set; }
```

## Remarks
Prompt text is displayed when the text box is empty
and does not have keyboard focus. This text is displayed in italics. The default value is Nothing nullptr a null reference ( Nothing in Visual Basic) .